tap "anomalyco/tap"
tap "moderneinc/moderne"
tap "softleader/tap"
tap "steipete/tap"
brew "autojump"
brew "bat"
brew "dive"
brew "fzf"
brew "gh"
brew "golangci-lint"
brew "gum"
brew "helm"
brew "hugo"
brew "istioctl"
brew "jq"
brew "kubernetes-cli@1.31"
brew "kustomize"
brew "macmon"
brew "minikube"
brew "mkcert"
brew "node"
brew "nss"
brew "ollama"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "redis"
brew "ruby"
brew "telnet"
brew "tmux"
brew "tree"
brew "uv"
brew "yh"
brew "yq"
brew "anomalyco/tap/opencode"
brew "moderneinc/moderne/mod"
brew "softleader/tap/slctl"
cask "1password"
cask "1password-cli"
cask "aldente"
cask "another-redis-desktop-manager"
cask "antigravity"
cask "chatgpt"
cask "copilot-cli"
cask "cyberduck"
cask "dbeaver-community"
cask "discord"
cask "folo"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "font-maple-mono-normal"
cask "font-maple-mono-normal-nf-cn"
cask "fork"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "headlamp"
cask "hiddenbar"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "lens"
cask "mongodb-compass"
cask "monitorcontrol"
cask "ngrok"
cask "opencode-desktop"
cask "pdfsam-basic"
cask "postman"
cask "raycast"
cask "slack"
cask "springtoolsforeclipse"
cask "sublime-text"
cask "switchhosts"
cask "tailscale-app"
cask "typora"
cask "visual-studio-code"
cask "webex"
cask "wireshark-app"
cask "zoom"
vscode "adpyke.vscode-sql-formatter"
vscode "atommaterial.a-file-icon-vscode"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "ekeel.groovy-beautify"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "jebbs.plantuml"
vscode "mellowmarshmallow.groovy"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sst-dev.opencode"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/lint/golint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
